[
  {
    "name": "Emeril's Fried Rice",
    "ingredients": "1/4 c Peanut oil|3 c Cooked white rice|1/2 c Chopped green onions|1/2 c Shredded roasted pork|1/2 c Diced shrimp|1/2 c Diced Chinese sausage|2 ts Minced garlic|3 Eggs|1 1/2 tb Soy sauce|2 tb Sesame oil|3 tb Finely chopped parsley|2 c Stir-fry vegetables|1 tb Finely chopped parsley|5 Wonton wrappers, julienne,; fried until golden brown",
    "servings": "1 Servings",
    "instructions": "Heat the oil in the wok. Toss in the rice until hot and golden. Toss in the~ green onions, pork, shrimp, and sausage. Stir in the garlic, eggs, soy sauce, sesame oil and parsley. Stir-fry for 2 minutes. Season with salt and pepper. Mound the rice in the center of the vegetables. Garnish with parsley and fried wontons. :ESSENCE OF EMERIL SHOW#EE2378"
  },
  {
    "name": "Mediterranean Fried Rice",
    "ingredients": "**FOR THE SAUCE**|2 tb Lemon juice|2 tb Tomato paste|1/4 ts Saffron; soaked*|Salt|Freshly ground pepper",
    "servings": "4 servings",
    "instructions": "~ - - - - 1 1/2 tablespoons extra-virgin olive oil (up to 2 tbsp) 2 cloves garlic (up to 3 cloves) -- minced 1 leek, cleaned and trimmed -- finely chopped 1/4 cup fennel -- thinly sliced OR celery -- thinly sliced 3 cups cooked white rice (up to 4 c) 1 tomato -- seeded and diced 1/4 cup chickpeas 2 tablespoons pine nuts -- lightly toasted 8 black olives (pref oil-cured) 3 dried tomatoes -- cut in thin slices 1 bunch basil -- stemmed * Soak saffron in 1 tabelspoon water or Basic Vegetable Stock for 15 minutes For the sauce, combine the lemon juice, tomato paste, saffron, salt, and pepper in a small bowl and whisk until smooth. Add plenty of salt and pepper. The mixture should be highly seasoned. Just before serving, heat a wok or large non-stick frying pan over a high flame. Swirl in the oil. Add the garlic and leek and stir fry for 15 seconds, or until fragrant but not brown. Add the fennel and stir fry for 1 to 2 minutes, or until the fennel is tender. Stir in the rice, tomato, chickpeas, pine nuts, olives, and dried tomatoes, and most of the basil. Stir fry for 2 minutes, or until the ingredients are thoroughly heated. Stir in the sauce and cook for thirty seconds. Correct the seasoning, adding salt or lemon juice to taste. Decorate the rice with the remaining basil leaves and serve at once. Serves 6 as a side dish or 4 as a main course."
  },
  {
    "name": "Beef And Vegetable Fried Rice",
    "ingredients": "1 lb Lean ground beef|2 Cloves garlic; crushed|1 ts Grated fresh ginger or|1/4 ts Ground ginger|2 tb Water|1 Red bell pepper; cut into 1/2 inch pieces|1 pk Frozen pea pods; (6 oz.)|3 c Cold cooked rice|3 tb Soy sauce|2 ts Dark seasame oil|1/4 c Thinly sliced green onions",
    "servings": "4 servings",
    "instructions": "1.In large nonstick skillet, brown ground beef, garlic and ginger over medium heat 8 to 10 minutes or until beef is no longer pink, breaking up into 3/4 inch crumbles. Remove with slotted spoon; pour off drippings 2.In same skillet, heat water over medium-high heat until hot. Add bell pepper and pea pods; cook 3 minutes or until bell pepper is crisp-tender, stirring occasionally. Add rice, soy sauce and seasame oil; mix well. Return beef to skillet; heat through, about 5 minutes. Stir in green onions before serving"
  },
  {
    "name": "Benihana Fried Rice",
    "ingredients": "1/2 ts Chopped onion|1/3 ts Chopped carrots|1/3 ts Green onions|4 oz Steamed rice|3 Pinches salt|7 ts Cream butter|1 Egg|1/2 ts Oil|1 oz Cooked chicken|1/4 ts Sesame seeds|3 Pinches pepper|1 ts Soy sauce",
    "servings": "1 servings",
    "instructions": "Scramble eggs and chop after cooking. Saute chopped onion, green onion and carrots until done and mix with chopped scrambled egg and chicken. Break off chunks of steamed rice and mix with vegetable, egg and chicken mixture. Add sesame seeds and salt and pepper. Stir in cream butter and soy sauce into the mixture. Yield: 1 serving"
  },
  {
    "name": "Ch'ao Fan (Fried Rice)",
    "ingredients": "4 c Cooked rice|2 Eggs|1 c Each of shredded or diced meat and vegetables|1/4 c Diced green onion|2 tb Soy sauce|1/2 ts Sugar.",
    "servings": "4 Servings",
    "instructions": "Here's the fried rice recipe that I always use--it's from the Encyclopedia under Chinese Cookery."
  },
  {
    "name": "Char Kway Teow (Stir-Fried Rice Noodles)",
    "ingredients": "2 Chinese sausages (lop cheong)|1/4 lb Medium shrimp (36 to 40 per pound), shelled and deveined|1 ts Salt|1/4 lb Cleaned squid, with tentacles (See Technique Note)|1/4 lb Chinese barbecued pork|1/4 ts White pepper|1 1/2 tb Dark soy sauce|1 1/2 tb Light soy sauce|1 tb Oyster sauce|2 lb Fresh rice noodles, in 5/8-inch-wide strips|4 tb Peanut oil|4 Cloves garlic, chopped|4 Shallots, sliced (1/2 cup sliced)|6 Fresh red chiles, seeded and chopped|1 c Bean sprouts, tails removed|1 c Shredded Chinese cabbage|2 lg Eggs|4 Green onions, chopped|Fresh coriander sprigs, for garnish",
    "servings": "4 Servings",
    "instructions": "Nothing is more fascinating and delicious than eating at the open- air street hawker centers in Asia, particularly in Singapore. Each stall serves a specialty, typically an honest, unpretentious, home-style dish for $1 to $3 a plate. This rice noodle dish is hawker food at its best. If done right, its fragrance will tell you how good it's going to be as soon as it arrives at your table. Singapore hawkers will use whatever seafoods are available, including cockles and sliced fish cakes in addition to those suggested in this recipe. Feel free to experiment. 1. Steam the sausages for 10 minutes. Cut them in thin diagonal slices. Toss the shrimp with 1/2 teaspoon of the salt. Let them stand for 10 minutes, rinse well with cold water, drain, and pat dry. Cut the squid into 1/4 inch rings and tentacles. Cut the barbecued pork into 1/4-inch-thick slices. Combine the white pepper, soy sauces, and oyster sauce in a bowl; set aside. 2. Just before cooking, put the noodles in a large bowl and pour boiling water over them. Stir gently with chopsticks to separate the strands, drain, and shake off the excess water. 3. Preheat a wok; when hot, add 2 tablespoons of the oil. Add the remaining 1/2 teaspoon salt and the garlic, shallots, and chiles and cook over medium-high heat until the garlic is golden brown. Increase the heat to high and toss in the shrimp and squid; stirfry until the shrimp turn bright orange and the squid looks opaque white, about 2 minutes. Add the sausage slices, barbecued pork, bean sprouts, and cabbage; toss and stir until the vegetables begin to wilt. Remove everything in the wok to a platter and set aside. 4. Add the remaining 2 tablespoons of oil to the wok; when hot, toss in the well-drained noodles. Gently toss and flip the noodles to heat them through. Be careful not to break them; it is okay if they brown slightly. Push the noodles up the sides of the wok to make a well in the middle; pour in the soy sauce mixture, then toss the noodles gently to sauce them evenly. Make a well again and break the eggs into the middle. Without mixing them with the noodles, scramble the eggs lightly. When the eggs begin to set, add the green onions and return the seafood mixture. Gently toss together to reheat and mix. Serve hot, with a hot chill sauce for seasoning to taste. Garnish with coriander sprigs. NOTE: Both here and in Asia, fresh rice noodles are usually purchased rather than made at home. Look for them in Asian markets or Chinese take-out dim sum shops. This dish can be prepared with dried rice noodles; however, it is worth taking the time to seek out the fresh variety. Make certain that your wok is well seasoned or the fragile rice noodles will break apart and stick to the pan. Although I hesitate recommending that you cook with a non stick wok or skillet, they will work fine if you are more comfortable with them. TECHNIQUE NOTE; To clean squid, start by separating all the tentacles from the heads, cutting across as close as possible to the eyes. Squeeze out and discard the hard, pea sized beak in the center of each cluster of tentacles. Rinse the tentacles and drain them in a colander. Grasp the mantle (the saclike \"body\" of the squid) in one hand and the head in the other and pull apart; the entrails will pull out attached to the head. Pull the transparent quill out of each mantle. Discard everything but the tentacles and mantles. Running a little water into each mantle to open it up, reach in with a finger and pull out any entrails remaining inside. (Working over a second colander to catch all the debris will make cleanup easier.) You can remove the spotted outer skin or leave it on (I prefer to remove it). Transfer the cleaned mantles to a cutting board, slice them crosswise to the desired size,and add them to the tentacles in the colander. Give everything another rinse and drain thoroughly. Makes 4 to 6 servings"
  },
  {
    "name": "Cantonese Fried Rice",
    "ingredients": "4 tb Oil|1 md Onion; diced|2 Eggs; beaten|1 tb Soy sauce; (I use 2 tbsp tamari sauce)|2 1/2 c COOKED rice|1 ds Pepper",
    "servings": "1 Servings",
    "instructions": "In 10 inch skillet, heat oil on medium flame. Add diced onion and saute until translucent. Add eggs and fry, stirring constantly to break eggs into tiny pieces. Add soy sauce and stir. Add cooked rice. Sprinkle with dash of pepper. Combine well, stirring over heat, about 2 minutes. Add a little more soy sauce if necessary. The first time I made this I doubled the rice because I did not focus on the word cooked rice. Forwarned is forarmed."
  },
  {
    "name": "Pineapple Fried Rice",
    "ingredients": "1 Pineapple; in two halves|2 tb Vegetable oil|1 Egg; lightly beaten|1 Chicken breast; finely chopped|1 Onion; finely chopped|2 Cloves garlic; finely chopped|2 c Cooked rice - jasmine or Basmati|2 tb Soy|2 ts Fish sauce|1 tb Sugar|1/2 ts White pepper",
    "servings": "1 servings",
    "instructions": "Scoop the flesh from the pineapple and finely dice, removing the core. Fry the onion and garlic in the oil until translucent and add the chicken. Continue to fry until the chicken is opaque and add the egg. Stir fry for a further 30 seconds until scrambled. Add the rice and continue to toss until combined. Season with the soy, fish sauce, sugar and pepper and fill the pineapple shells. Garnish with spring onions or coriander."
  },
  {
    "name": "Pineapple Fried Rice",
    "ingredients": "1 Ripe pineapple; preferred|(or 1 cup canned pineapple chunks plus|Extra for garnish)|4 c Cooked long-grain rice; chilled|(such as jasmine rice)|3 tb Vegetable oil|1 sm Onion; finely diced|5 Garlic cloves; chopped|1 tb Grated fresh ginger|1 c Blanched; sliced Chinese long beans|1/2 c Seeded; diced tomatoes|1 c Finely-chopped fresh pineapple|3 tb Thai fish sauce|1 ts Sugar|3 Green onions; thinly sliced|On the diagonal",
    "servings": "4 servings",
    "instructions": "If serving rice in fresh pineapple, halve the pineapple lengthwise, leaving the leafy top intact and cutting through it. Hollow out each half, reserving 1 cup of the fruit for the rice and extra for garnishing. Save remaining pineapple for another use. Make a small slice on the outside of each half to create a flat base to hold the pineapple steady. Set aside. Crumble the cold rice between your fingers to separate the grains, and set aside. Heat 2 tablespoons of the oil in a wok or large skillet, swirling to coat the pan. Add the onion and toss until soft, 3 to 5 minutes. Add the garlic and toss until fragrant and soft, about 1 to 2 minutes. Add the ginger and toss for another minute. Add the remaining tablespoon of oil, then add the rice. Fry for 2 to 3 minutes over high heat, then add the beans, tomatoes, and pineapple, and fry 2 to 3 minutes more. Add the fish sauce and sugar, and toss until ingredients are well combined and rice is heated thoroughly, about 5 minutes. Add the green onions and toss to combine. Remove from the heat and transfer to a serving platter, or if using fresh pineapple, fill each half of prepared pineapple with warm rice and garnish with extra chunks of pineapple. This recipe yields 4 to 6 servings."
  },
  {
    "name": "Oriental Fried Rice",
    "ingredients": "3 c Cooked brown rice; cold|1/2 c Slivered cooked roast pork|1/2 c Finely chopped celery|1/2 c Fresh bean sprouts|1/3 c Sliced green onions|1 Egg; beaten|1/2 ts Black pepper|2 tb Soy sauce",
    "servings": "6 Servings",
    "instructions": "Combine rice, pork, celery, bean sprouts, onions and egg in large skillet coated with nonstick cooking spray. Cook, stirring, 3 minutes over high heat. Add pepper and soy sauce. Cook, stirring, 1 minute longer. NOTES : Calories: 161.8 (22% from fat) Fat: 3.9g cholesterol: 40mg Carbohydrate: 24.9g Fiber: 2.2g Sodium: 370mg"
  }
]
